# 6_ - Dealing with missing data

## Identifying missing values in tabular data
Let's start your study by identifying missing data in tables

Library importantion and load the file using read_csv function

In [ ]:
import pandas as pd

df = pd.read_csv('missing.csv')
df

      A     B     C    D
0   1.0   2.0   3.0  4.0
1   5.0   6.0   NaN  8.0
2  10.0  11.0  12.0  NaN

For each row of the table the function checks for missing data and returns for each row 1 if the is otherwise 0

In [ ]:
df.isnull().sum()

A    0
B    0
C    1
D    1
dtype: int64

In [ ]:
# Cria um array numpy com todos os valores do DataFrame

df.values

array([[ 1.,  2.,  3.,  4.],
       [ 5.,  6., nan,  8.],
       [10., 11., 12., nan]])

## Deleting samples or *features* with missing values

The dropna function with a axis=0 parameter removes rows that have missing data

In [ ]:
# Remove colunas que contém valores faltantes

df.dropna(axis=0)

     A    B    C    D
0  1.0  2.0  3.0  4.0

The dropna function with a axis=1 parameter removes columns that have missing data

In [ ]:
# Removendo colunas que contém valores faltantes

df.dropna(axis=1)

      A     B
0   1.0   2.0
1   5.0   6.0
2  10.0  11.0

The dropna function with a how=all parameter removes columns that have missing data

In [ ]:
# "Drop" apenas nas linhas onde todas as colunas são NaN

df.dropna(how='all')

      A     B     C    D
0   1.0   2.0   3.0  4.0
1   5.0   6.0   NaN  8.0
2  10.0  11.0  12.0  NaN

The dropna function with a thresh parameter removes the lines that do not have a specfied amount of real values

In [ ]:
# Removendo linhas que possuem menos de 3 valores reais

df.dropna(thresh=4)

     A    B    C    D
0  1.0  2.0  3.0  4.0

The dropna function with a subset parameter removes the lines that contains a values NaN in your particular column

In [ ]:
# Remove apenas linhas onde NaN aparece em uma coluna específica

df.dropna(subset=['C'])

      A     B     C    D
0   1.0   2.0   3.0  4.0
2  10.0  11.0  12.0  NaN